data/2023_08_22/read_write_split_disable_6_with_read_pct_20/test-mysql-run-20-80-125-time-2023-08-22-21-23.txt
run sysbench
check mysql database exists
mysql host 172.16.134.200 connect success!
database mydb exists
/usr/bin/sysbench
cd ./sysbench/src/lua;sysbench --db-driver=mysql --mysql-host=172.16.134.200 --mysql-port=3306 --mysql-user=root --mysql-password=sf2gxx9r --mysql-db=mydb --table_size=2000000 --tables=50 --time=60 --threads=125 --events=0 --percentile=99 --read-percent=20 --write-percent=80 --skip_trx=on --mysql-ignore-errors=1062 --db-ps-mode=disable --report-interval=1 oltp_read_write_pct run
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 125
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 125 tps: 0.00 qps: 10428.84 (r/w/o: 2496.37/7932.47/0.00) lat (ms,99%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 125 tps: 125.08 qps: 8867.53 (r/w/o: 2501.56/6365.97/0.00) lat (ms,99%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 125 tps: 87.00 qps: 7274.05 (r/w/o: 1544.01/5730.04/0.00) lat (ms,99%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 125 tps: 38.00 qps: 6254.02 (r/w/o: 956.00/5298.01/0.00) lat (ms,99%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 125 tps: 64.00 qps: 5424.03 (r/w/o: 943.00/4481.02/0.00) lat (ms,99%): 2238.47 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 125 tps: 61.00 qps: 6104.03 (r/w/o: 1557.01/4547.02/0.00) lat (ms,99%): 2320.55 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 125 tps: 34.00 qps: 5575.70 (r/w/o: 516.97/5058.72/0.00) lat (ms,99%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 125 tps: 91.00 qps: 6619.13 (r/w/o: 1983.04/4636.09/0.00) lat (ms,99%): 2320.55 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 125 tps: 4.00 qps: 4578.22 (r/w/o: 80.00/4498.21/0.00) lat (ms,99%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 125 tps: 121.00 qps: 7052.78 (r/w/o: 2419.92/4632.85/0.00) lat (ms,99%): 2405.65 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 125 tps: 11.00 qps: 5501.06 (r/w/o: 92.00/5409.06/0.00) lat (ms,99%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 125 tps: 114.00 qps: 7530.91 (r/w/o: 2407.97/5122.94/0.00) lat (ms,99%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 125 tps: 16.00 qps: 5436.02 (r/w/o: 241.00/5195.01/0.00) lat (ms,99%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 125 tps: 109.00 qps: 6968.07 (r/w/o: 2259.02/4709.05/0.00) lat (ms,99%): 2238.47 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 125 tps: 5.00 qps: 4529.94 (r/w/o: 77.00/4452.95/0.00) lat (ms,99%): 2238.47 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 125 tps: 120.00 qps: 7274.10 (r/w/o: 2423.03/4851.06/0.00) lat (ms,99%): 2279.14 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 125 tps: 7.00 qps: 5476.78 (r/w/o: 131.99/5344.79/0.00) lat (ms,99%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 125 tps: 118.00 qps: 6489.22 (r/w/o: 2365.08/4124.14/0.00) lat (ms,99%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 125 tps: 1.00 qps: 5017.96 (r/w/o: 23.00/4994.96/0.00) lat (ms,99%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 125 tps: 121.00 qps: 6918.89 (r/w/o: 2386.96/4531.93/0.00) lat (ms,99%): 2320.55 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 125 tps: 4.00 qps: 5038.74 (r/w/o: 112.99/4925.75/0.00) lat (ms,99%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 125 tps: 112.01 qps: 6501.48 (r/w/o: 2184.16/4317.32/0.00) lat (ms,99%): 2362.72 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 125 tps: 13.00 qps: 5878.12 (r/w/o: 316.01/5562.12/0.00) lat (ms,99%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 125 tps: 106.00 qps: 6315.73 (r/w/o: 2061.91/4253.82/0.00) lat (ms,99%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 125 tps: 21.00 qps: 6616.29 (r/w/o: 478.02/6138.27/0.00) lat (ms,99%): 2279.14 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 125 tps: 106.93 qps: 6199.03 (r/w/o: 2099.66/4099.38/0.00) lat (ms,99%): 2082.91 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 125 tps: 16.01 qps: 5849.66 (r/w/o: 359.22/5490.43/0.00) lat (ms,99%): 2082.91 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 125 tps: 99.00 qps: 6296.99 (r/w/o: 1980.00/4316.99/0.00) lat (ms,99%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 125 tps: 26.00 qps: 5895.10 (r/w/o: 520.01/5375.09/0.00) lat (ms,99%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 125 tps: 97.00 qps: 6433.85 (r/w/o: 1909.96/4523.90/0.00) lat (ms,99%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 125 tps: 28.00 qps: 5661.04 (r/w/o: 590.00/5071.03/0.00) lat (ms,99%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 125 tps: 86.99 qps: 6108.64 (r/w/o: 1560.91/4547.73/0.00) lat (ms,99%): 2238.47 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 125 tps: 39.00 qps: 6479.33 (r/w/o: 944.05/5535.28/0.00) lat (ms,99%): 2320.55 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 125 tps: 77.00 qps: 5847.00 (r/w/o: 1533.00/4314.00/0.00) lat (ms,99%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 125 tps: 47.00 qps: 6217.01 (r/w/o: 962.00/5255.01/0.00) lat (ms,99%): 2238.47 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 125 tps: 73.99 qps: 5756.57 (r/w/o: 1216.91/4539.66/0.00) lat (ms,99%): 2320.55 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 125 tps: 50.00 qps: 6049.28 (r/w/o: 1263.06/4786.22/0.00) lat (ms,99%): 2320.55 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 125 tps: 45.00 qps: 5519.28 (r/w/o: 863.04/4656.24/0.00) lat (ms,99%): 2320.55 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 125 tps: 79.00 qps: 6356.92 (r/w/o: 1616.98/4739.94/0.00) lat (ms,99%): 2320.55 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 125 tps: 42.00 qps: 5719.06 (r/w/o: 741.01/4978.05/0.00) lat (ms,99%): 2238.47 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 125 tps: 83.00 qps: 6570.89 (r/w/o: 1758.97/4811.92/0.00) lat (ms,99%): 2320.55 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 125 tps: 40.00 qps: 5864.12 (r/w/o: 780.02/5084.10/0.00) lat (ms,99%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 125 tps: 86.00 qps: 6397.98 (r/w/o: 1736.00/4661.99/0.00) lat (ms,99%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 125 tps: 32.00 qps: 5615.89 (r/w/o: 611.99/5003.90/0.00) lat (ms,99%): 2279.14 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 125 tps: 93.00 qps: 6735.03 (r/w/o: 1873.01/4862.02/0.00) lat (ms,99%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 125 tps: 28.00 qps: 5359.93 (r/w/o: 552.99/4806.94/0.00) lat (ms,99%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 125 tps: 95.00 qps: 6701.19 (r/w/o: 1916.05/4785.13/0.00) lat (ms,99%): 2238.47 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 125 tps: 31.00 qps: 5529.91 (r/w/o: 530.99/4998.92/0.00) lat (ms,99%): 2238.47 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 125 tps: 85.00 qps: 5345.91 (r/w/o: 1723.97/3621.94/0.00) lat (ms,99%): 2362.72 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 125 tps: 20.00 qps: 5807.21 (r/w/o: 475.02/5332.19/0.00) lat (ms,99%): 2405.65 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 125 tps: 103.00 qps: 6558.99 (r/w/o: 2033.00/4525.99/0.00) lat (ms,99%): 2320.55 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 125 tps: 18.00 qps: 5101.01 (r/w/o: 383.00/4718.01/0.00) lat (ms,99%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 125 tps: 85.00 qps: 6225.97 (r/w/o: 1698.99/4526.98/0.00) lat (ms,99%): 2320.55 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 125 tps: 38.00 qps: 5624.01 (r/w/o: 765.00/4859.01/0.00) lat (ms,99%): 2320.55 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 125 tps: 87.00 qps: 6700.88 (r/w/o: 1579.97/5120.91/0.00) lat (ms,99%): 2279.14 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 125 tps: 38.00 qps: 5888.09 (r/w/o: 920.01/4968.08/0.00) lat (ms,99%): 2279.14 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 125 tps: 80.00 qps: 6411.92 (r/w/o: 1504.98/4906.94/0.00) lat (ms,99%): 2082.91 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 125 tps: 46.00 qps: 6085.94 (r/w/o: 1012.99/5072.95/0.00) lat (ms,99%): 2238.47 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 125 tps: 68.00 qps: 5763.08 (r/w/o: 1272.02/4491.06/0.00) lat (ms,99%): 2279.14 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 125 tps: 55.00 qps: 5959.09 (r/w/o: 1181.02/4778.07/0.00) lat (ms,99%): 2279.14 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 124 tps: 71.00 qps: 4348.99 (r/w/o: 9.00/4339.99/0.00) lat (ms,99%): 2320.55 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            75040
        write:                           300160
        other:                           0
        total:                           375200
    transactions:                        3752   (61.23 per sec.)
    queries:                             375200 (6123.02 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          61.2758s
    total number of events:              3752

Latency (ms):
         min:                                 1134.55
         avg:                                 2028.34
         max:                                 2437.83
         99th percentile:                     2320.55
         sum:                              7610314.35

Threads fairness:
    events (avg/stddev):           30.0160/0.13
    execution time (avg/stddev):   60.8825/0.27